Ran Plan for project: `iam/suna-id` dir: `terraform/iam/suna-id` workspace: `default`

<details><summary>Show Output</summary>

```diff
module.terraform_runner.data.aws_iam_policy_document.policy_document: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_passrole: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_s3: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_dynamodb: Reading...
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_dynamodb: Read complete after 0s [id=3869619765]
module.terraform_runner.data.aws_iam_policy_document.policy_document: Read complete after 0s [id=3351616110]
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_s3: Read complete after 0s [id=3607919700]
module.terraform_runner.data.aws_iam_policy_document.terraform_runner_passrole: Read complete after 0s [id=755360459]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_group.devops_black will be created
+ resource "aws_iam_group" "devops_black" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "devops_black"
      + path      = "/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.devops_black will be created
+ resource "aws_iam_group_membership" "devops_black" {
      + group = "devops_black"
      + id    = (known after apply)
      + name  = "devops_black"
    }

  # aws_iam_group_policy_attachment.devops_black will be created
+ resource "aws_iam_group_policy_attachment" "devops_black" {
      + group      = "devops_black"
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AdministratorAccess"
    }

  # module.terraform_runner.aws_iam_role.terraform_runner will be created
+ resource "aws_iam_role" "terraform_runner" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::066346343248:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 14400
      + name                  = "terraform-runner"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.terraform_runner.aws_iam_role_policy.terraform_runner_dynamodb will be created
+ resource "aws_iam_role_policy" "terraform_runner_dynamodb" {
      + id          = (known after apply)
      + name        = "terraform-runner-dynamodb-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "dynamodb:UpdateTable",
                          + "dynamodb:UpdateItem",
                          + "dynamodb:Scan",
                          + "dynamodb:PutItem",
                          + "dynamodb:GetItem",
                          + "dynamodb:DescribeTable",
                          + "dynamodb:DeleteItem",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:dynamodb:ap-northeast-2:066346343248:table/terraform-lock"
                      + Sid      = "AllowDynamoDBAccess"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.terraform_runner.aws_iam_role_policy.terraform_runner_passrole will be created
+ resource "aws_iam_role_policy" "terraform_runner_passrole" {
      + id          = (known after apply)
      + name        = "terraform-runner-passrole"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "iam:PassRole"
                      + Effect   = "Allow"
                      + Resource = "*"
                      + Sid      = "AllowIAMPassRole"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.terraform_runner.aws_iam_role_policy.terraform_runner_s3 will be created
+ resource "aws_iam_role_policy" "terraform_runner_s3" {
      + id          = (known after apply)
      + name        = "terraform-runner-s3"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*-apnortheast2-tfstate/*"
                      + Sid      = "AllowTFBackendBucket"
                    },
                  + {
                      + Action   = "s3:ListBucket"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::*-apnortheast2-tfstate/*"
                      + Sid      = "AllowTFBackendBucketList"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.terraform_runner.aws_iam_role_policy_attachment.terraform_runner_readonly will be created
+ resource "aws_iam_role_policy_attachment" "terraform_runner_readonly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/ReadOnlyAccess"
      + role       = (known after apply)
    }

Plan: 8 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/suna-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.suna.terraform.devart.tv/lock?id=sunaleed%252Ftest-provisioning%252Fterraform%252Fiam%252Fsuna-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/suna-id`
</details>
Plan: 8 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
